balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6012A.PIC
      <edc:DCRDef edc:access="--nn--nn----nnnn" edc:cname="FSS" edc:default="0xffff" edc:desc="" edc:impl="0x330f" edc:name="FSS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x330f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SWRP" edc:desc="Secure Segment Program Write Protect" edc:mask="0x1" edc:name="SWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WR_PROT_SEC_OFF" edc:codeguardidref="PgmSecureWrtProtectOff" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WR_PROT_SEC_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WR_PROT_SEC_ON" edc:codeguardidref="PgmSecureWrtProtectOn" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WR_PROT_SEC_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SSS" edc:desc="Secure Segment Program Flash Memory Code Protection" edc:mask="0x7" edc:name="SSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_SEC_CODE" edc:codeguardidref="PgmSecureNone" edc:desc="No Secure Segment" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_SEC_CODE" edc:codeguardidref="PgmSecureStdSm" edc:desc="Standard Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_SMALL_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_MED_SEC_CODE" edc:codeguardidref="PgmSecureStdMed" edc:desc="Standard Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_MED_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_LAR_SEC_CODE" edc:codeguardidref="PgmSecureStdLarge" edc:desc="Standard Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_LAR_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:desc="No Secure Segment" edc:isidehidden="true" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_SEC_CODE" edc:codeguardidref="PgmSecureHighSm" edc:desc="High Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_SMALL_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_SEC_CODE" edc:codeguardidref="PgmSecureHighMed" edc:desc="High Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_MEDIUM_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_SEC_CODE" edc:codeguardidref="PgmSecureHighLarge" edc:desc="High Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_LARGE_SEC_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="ESS" edc:desc="Secure Segment Data EEPROM Protection" edc:mask="0x3" edc:name="ESS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_SEC_EEPROM" edc:codeguardidref="EEPROMSecureNone" edc:desc="No Segment Data EEPROM" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_SEC_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="SMALL_SEC_EEPROM" edc:codeguardidref="EEPROMSecureSm" edc:desc="Small-sized Secure Data EEPROM" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="SMALL_SEC_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="MED_SEC_EEPROM" edc:codeguardidref="EEPROMSecureMed" edc:desc="Medium-sized Secure Data EEPROM" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="MED_SEC_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LAR_SEC_EEPROM" edc:codeguardidref="EEPROMSecureLarge" edc:desc="Large-sized Secure Data EEPROM" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LAR_SEC_EEPROM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RSS" edc:desc="Secure Segment Data RAM Protection" edc:mask="0x3" edc:name="RSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_SEC_RAM" edc:codeguardidref="DataSecureNone" edc:desc="No Secure RAM" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_SEC_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="SMALL_SEC_RAM" edc:codeguardidref="DataSecureSm" edc:desc="Small-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="SMALL_SEC_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="MED_SEC_RAM" edc:codeguardidref="DataSecureMed" edc:desc="Medium-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="MED_SEC_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LARGE_SEC_RAM" edc:codeguardidref="DataSecureLarge" edc:desc="Large-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="LARGE_SEC_RAM"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0xffff" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="GWRP_OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GWRP_ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GCP" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GSS_OFF" edc:codeguardidref="PgmGenNone" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="CODE_PROT_OFF"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GSS_ON" edc:codeguardidref="PgmGenStd" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_ON"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x18000"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GSS_HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_HIGH"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x18000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
