balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6012A.PIC
        <edc:SFRDef edc:access="n-n------c----nn" edc:cname="SPI2STAT" edc:desc="" edc:impl="0xa043" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0------0----00" edc:name="SPI2STAT" edc:nzwidth="0x10" edc:por="0-0------0----00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPITBF" edc:desc="" edc:mask="0x1" edc:name="SPITBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SPISIDL" edc:desc="" edc:mask="0x1" edc:name="SPISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIEN" edc:desc="" edc:mask="0x1" edc:name="SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="SPI 2" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn-nnnnnnnnnnnn" edc:cname="SPI2CON" edc:desc="" edc:impl="0x6fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00-000000000000" edc:name="SPI2CON" edc:nzwidth="0x10" edc:por="-00-000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="" edc:mask="0x1" edc:name="PPRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE1" edc:desc="" edc:mask="0x1" edc:name="PPRE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE0" edc:desc="" edc:mask="0x1" edc:name="SPRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE1" edc:desc="" edc:mask="0x1" edc:name="SPRE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPRE2" edc:desc="" edc:mask="0x1" edc:name="SPRE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIFSD" edc:desc="" edc:mask="0x1" edc:name="SPIFSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PPRE" edc:desc="" edc:mask="0x1" edc:name="PPRE0" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SPRE" edc:desc="" edc:mask="0x1" edc:name="SPRE0" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPI2BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPI2BUF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPI2BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="n-n-nnnnnnn---nn" edc:cname="DCICON1" edc:desc="" edc:impl="0xafe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000000---00" edc:name="DCICON1" edc:nzwidth="0x10" edc:por="0-0-0000000---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="COFSM" edc:desc="" edc:mask="0x3" edc:name="COFSM" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DJST" edc:desc="" edc:mask="0x1" edc:name="DJST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSDOM" edc:desc="" edc:mask="0x1" edc:name="CSDOM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UNFM" edc:desc="" edc:mask="0x1" edc:name="UNFM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COFSD" edc:desc="" edc:mask="0x1" edc:name="COFSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSCKE" edc:desc="" edc:mask="0x1" edc:name="CSCKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSCKD" edc:desc="" edc:mask="0x1" edc:name="CSCKD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLOOP" edc:desc="" edc:mask="0x1" edc:name="DLOOP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DCISIDL" edc:desc="" edc:mask="0x1" edc:name="DCISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DCIEN" edc:desc="" edc:mask="0x1" edc:name="DCIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="COFSM0" edc:desc="" edc:mask="0x1" edc:name="COFSM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COFSM1" edc:desc="" edc:mask="0x1" edc:name="COFSM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="DCI" edc:pos="0xe"/>
        </edc:SFRDef>
