balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6012A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX0B1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX0B1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D0" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D00" edc:desc="" edc:mask="0x1" edc:name="TXB0D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D01" edc:desc="" edc:mask="0x1" edc:name="TXB0D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D02" edc:desc="" edc:mask="0x1" edc:name="TXB0D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D03" edc:desc="" edc:mask="0x1" edc:name="TXB0D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D04" edc:desc="" edc:mask="0x1" edc:name="TXB0D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D05" edc:desc="" edc:mask="0x1" edc:name="TXB0D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D06" edc:desc="" edc:mask="0x1" edc:name="TXB0D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D07" edc:desc="" edc:mask="0x1" edc:name="TXB0D07" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D10" edc:desc="" edc:mask="0x1" edc:name="TXB0D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D11" edc:desc="" edc:mask="0x1" edc:name="TXB0D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D12" edc:desc="" edc:mask="0x1" edc:name="TXB0D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D13" edc:desc="" edc:mask="0x1" edc:name="TXB0D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D14" edc:desc="" edc:mask="0x1" edc:name="TXB0D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D15" edc:desc="" edc:mask="0x1" edc:name="TXB0D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D16" edc:desc="" edc:mask="0x1" edc:name="TXB0D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D17" edc:desc="" edc:mask="0x1" edc:name="TXB0D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX0B2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX0B2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D2" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D20" edc:desc="" edc:mask="0x1" edc:name="TXB0D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D21" edc:desc="" edc:mask="0x1" edc:name="TXB0D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D22" edc:desc="" edc:mask="0x1" edc:name="TXB0D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D23" edc:desc="" edc:mask="0x1" edc:name="TXB0D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D24" edc:desc="" edc:mask="0x1" edc:name="TXB0D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D25" edc:desc="" edc:mask="0x1" edc:name="TXB0D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D26" edc:desc="" edc:mask="0x1" edc:name="TXB0D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D27" edc:desc="" edc:mask="0x1" edc:name="TXB0D27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D30" edc:desc="" edc:mask="0x1" edc:name="TXB0D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D31" edc:desc="" edc:mask="0x1" edc:name="TXB0D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D32" edc:desc="" edc:mask="0x1" edc:name="TXB0D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D33" edc:desc="" edc:mask="0x1" edc:name="TXB0D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D34" edc:desc="" edc:mask="0x1" edc:name="TXB0D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D35" edc:desc="" edc:mask="0x1" edc:name="TXB0D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D36" edc:desc="" edc:mask="0x1" edc:name="TXB0D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D37" edc:desc="" edc:mask="0x1" edc:name="TXB0D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX0B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX0B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D40" edc:desc="" edc:mask="0x1" edc:name="TXB0D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D41" edc:desc="" edc:mask="0x1" edc:name="TXB0D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D42" edc:desc="" edc:mask="0x1" edc:name="TXB0D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D43" edc:desc="" edc:mask="0x1" edc:name="TXB0D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D44" edc:desc="" edc:mask="0x1" edc:name="TXB0D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D45" edc:desc="" edc:mask="0x1" edc:name="TXB0D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D46" edc:desc="" edc:mask="0x1" edc:name="TXB0D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D47" edc:desc="" edc:mask="0x1" edc:name="TXB0D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D50" edc:desc="" edc:mask="0x1" edc:name="TXB0D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D51" edc:desc="" edc:mask="0x1" edc:name="TXB0D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D52" edc:desc="" edc:mask="0x1" edc:name="TXB0D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D53" edc:desc="" edc:mask="0x1" edc:name="TXB0D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D54" edc:desc="" edc:mask="0x1" edc:name="TXB0D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D55" edc:desc="" edc:mask="0x1" edc:name="TXB0D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D56" edc:desc="" edc:mask="0x1" edc:name="TXB0D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D57" edc:desc="" edc:mask="0x1" edc:name="TXB0D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1TX0B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1TX0B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D60" edc:desc="" edc:mask="0x1" edc:name="TXB0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D61" edc:desc="" edc:mask="0x1" edc:name="TXB0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D62" edc:desc="" edc:mask="0x1" edc:name="TXB0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D63" edc:desc="" edc:mask="0x1" edc:name="TXB0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D64" edc:desc="" edc:mask="0x1" edc:name="TXB0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D65" edc:desc="" edc:mask="0x1" edc:name="TXB0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D66" edc:desc="" edc:mask="0x1" edc:name="TXB0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D67" edc:desc="" edc:mask="0x1" edc:name="TXB0D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnn-nn" edc:cname="C1TX0CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000-00" edc:name="C1TX0CON" edc:nzwidth="0x10" edc:por="---------0000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="C1RX1SID" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuuuuuuuuuu" edc:name="C1RX1SID" edc:nzwidth="0x10" edc:por="uuuxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXIDE" edc:desc="" edc:mask="0x1" edc:name="RXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x1" edc:name="SID" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="C1RX1EID" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="C1RX1EID" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
